test/ddc-stress-test.yml
config:
    target: http://api.ddc.vm
    phases:
      - duration: 10m
        arrivalRate: 1
    defaults:
      headers:
        Authorization: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2MTc5OTE1NjQsImlzcyI6IjM0MTcwOGY0LTQwZWUtNWUyYi1hNmIxLWU5NGE1YjVkMWMyMyIsInN1YiI6IkxvZ2luIn0.0fnSY3fjdaMGEuR_Q-Z1_cIaej93Zz1NSO25uFDC6Bo'
scenarios:
    - flow:
        - get:
            url: "/product?offset=0&limit=50"
            capture:
              - regexp: "[^]*"
                as: "response"
        # - log: "response= {{response}}"
        - get:
            url: "/homepageContent"
            capture:
              - regexp: "[^]*"
                as: "response3"
        - get:
            url: "/trendingProductCategory?query=trending:1"
            capture:
              - regexp: "[^]*"
                as: "response4"
        - get:
            url: "/promoBanner/home"
            capture:
              - regexp: "[^]*"
                as: "response5"
        - get:
            url: "/groupingCart"
            capture:
              - regexp: "[^]*"
                as: "response6"