test/ddc-stress-test0.yml
config:
    target: http://ddc.vm/
    phases:
      - duration: 10m
        arrivalRate: 1
    defaults:
      headers:
        Authorization: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2MTk4MTY4NDksImlzcyI6IjlmNDZjYTExLWJkNjgtMTFlOC1iMzNmLTAyMDAyM2JmMDAwMSIsInN1YiI6IkxvZ2luIn0.3IUsrXqzJadv7jZS3qwRmwmT61LUhl8Fi_Z2-keX7kE'
scenarios:
    - flow:
        - get:
            url: "/beranda"
            capture:
              - regexp: "[^]*"
                as: "response"
        # - log: "response= {{response}}"
        - get:
            url: "/keranjang"
            capture:
              - regexp: "[^]*"
                as: "response3"
        - get:
            url: "/profil"
            capture:
              - regexp: "[^]*"
                as: "response4"
        - get:
            url: "/brand/4"
            capture:
              - regexp: "[^]*"
                as: "response5"