test/ddc-stress-test_dev.yml
config:
    target: https://apigwdev.dusdusan.com
    phases:
      - duration: 10m
        arrivalRate: 1
    defaults:
      headers:
        Authorization: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE2MDg0NTAxNTEsImlzcyI6IjY5OTRlNGJkLWYxYmEtNWQzNi05NTU1LTMwZGE5ODZkNmRiZiIsInN1YiI6IkxvZ2luIn0.i9MY8p4fUhnJZ_6G-NQ1Y9rLhbToRV8RjmUWVKfbtcE'
scenarios:
    - flow:
        - get:
            url: "/product?offset=0&limit=50"
            capture:
              - regexp: "[^]*"
                as: "response"
        # - log: "response= {{response}}"
        - get:
            url: "/homepageContent"
            capture:
              - regexp: "[^]*"
                as: "response3"
        - get:
            url: "/trendingProductCategory?query=trending:1"
            capture:
              - regexp: "[^]*"
                as: "response4"
        - get:
            url: "/promoBanner/home"
            capture:
              - regexp: "[^]*"
                as: "response5"